[
    {
        "title": "Subscribe to tags",
        "description": "In order to know that a question relevant to your expertise has been posted, you need to add Interesting tags. To do so, go to your profile (by clicking your username on top) and then  click on the prefs tab present just before the accounts tab. There you can add your interesting and ignored tags; for example the interesting tags are those you are good at like it can be php, mysql, java, etc. Add as many as you think. Similarly, you also need to add Ignored tags; doing this will remove all questions from SO homepage that are not as per your expertise and this will also increase your chances of answering a question before anyone else does."
    },
    {
        "title": "Ask first on stackoverflow",
        "description": "If you have a good question - sensenet or non-sensenet related - ask on stackoverflow first."
    },
    {
        "title": "Ask good questions",
        "description": "[How do I ask a good question?](https://stackoverflow.com/help/how-to-ask)"
    },
    {
        "title": "Post high quality answers",
        "description": ""
    },
    {
        "title": "Try to be the first who answers",
        "description": "If there is question you think you know the answer of, jump to it instantly and answer it. If you have answered it correctly and are the first to answer then if anyone else visits that question, he may vote you up rather than providing his own correct answer that you have already provided.\n\nBy default, all answers are ordered by number of votes, so if you manage to get some votes, your answer will be on top of all there by having more chances of getting votes and finally chosen as the final correct answer something for which you earn 15 additional points.\n\nGetting your answer (correct one) to be first just makes it more likely to get quick votes but remember this is not the rule of thumb, an answer posted after even half an hour can be voted up and chosen as the final correct answer. Another important thing is that once you have posted your answer, you can revise it, add more details such as lists, images, etc. This shows how comprehensive answer you have given with examples/demos and makes your answer best in the queue."
    },
    {
        "title": "Use Upvotes and Comments",
        "description": ""
    },
    {
        "title": "Define your specality and go Niche",
        "description": "Maybe this tag only gets 10 questions a day. Maybe only 4 regular contributors even check the tag, let alone know how to answer them. The downside here is that the low-churn tags are also more likely (by volume) to be from new posters who don't know what the accept button is, or don't even have the rep to upvote. However, those few regular contributors to those tags will likely hit you with an upvote when they see your answer."
    },
    {
        "title": "Use formatting and lists wisely",
        "description": "- Makes the post more readable\n- Proves that the user put a bit of effort into it\n- Allows me to spot important points easier\n- puts some structure into the posting"
    },
    {
        "title": "Edit questions and answers",
        "description": "Code Spacing: Some questions may have code that is spaced more than usual. Try to take advantage of this and space out the code so that it is properly spaced neatly. Using an online compiler is helpful. Grammar Correction: Some people (most commonly new users) will post bad grammar. Edit that as soon as possible so that the question is good quality. Grave Accents: Names of methods should use grave accents to open and close. Block quotes: use the > followed by any text to block quote the entire line. This is generally used for errors. Titles: Sometimes the title contains unnecessary words (ie. C# in a question that is tagged C#). Delete those. For unclear titles, they can be fixed."
    },
    {
        "title": "Provide a good and simple code example",
        "description": ""        
    },
    {
        "title": "Be the *biggest*",
        "description": "If you can't be first, then be biggest. Go into massive detail. Lecture the person asking the question. If you're in a high-churn tag, a good bit of overkill can earn you 100 rep easily. Overkill doesn't work so well in low-churn tags, since overkill relies on many people seeing the sheer massiveness of your answer."        
    },
    {
        "title": "Add Pictures",
        "description": "To reinforce your answers, you can add pictures to them by copy pasting a picture url you know or searching on google. This makes your answer best of all. But remember, only add images when they help the answer – not just to make it shiny."        
    },
    {
        "title": "Use JS Bin",
        "description": "The JS Bin is the tool you can use to create and preview your html, javascript, css files online instantly. This turns out to be extremely handy when it comes to question about javascript, jquery, html or css. You can instantly create your pages and create a public link for them and show that link in your answers as demo. You could use Pastebin too if you are looking for an option with more languages. Once you provide a demo, your answer looks most authoritative."        
    },
    {
        "title": "Provide additional helpful info related to the question",
        "description": "This might include pointing out good/bad practices, pointing out completely different (better) approaches rather than helping to fix the one included in question etc. Impart the knowledge that OP as well as many future visitors will appreciate."                
    },
    {
        "title": "Help others to make their answers better, collaborate",
        "description": "Others will treat you the same way."
    },
    {
        "title": "Provide a detailed analysis of the question",
        "description": "Others will treat you the same way."
    },
    {
        "title": "Post an answer that does what the OP wants, but the way it should be done",
        "description": "Specifically, not what the OP is asking."
    },
    {
        "title": "Post multiple answers that are significantly different",
        "description": ""
    },
    {
        "title": "Once you have the privilege to review, review a lot",
        "description": ""
    },
    {
        "title": "Use Google Effectively",
        "description": "There are many questions posted which make you search on the google for their answers."
    },
    {
        "title": "Keep Your References Open",
        "description": "You should always keep your reference code or cheat sheets open so as to quickly locate the syntax or any details relevant to the question. For example, I always keep PHP official reference and JQuery cheat sheet open and this helps me greatly."
    },
    {
        "title": "Involve Yourself to Earn Badges",
        "description": "Other than reputation points, you would also like to earn Badges. There are a number of factors involved in earning these badges."
    }
]